import icon from "../images/ArenaIcon.png";
import image from "../images/210623.png";
import image110723 from "../images/110723.png";

export const ArenaAbout = {
  icon: icon,
  title:
    "Arena - небольшой арена-шутер на основе игры начало разработки которой, я начал почти без идеи в 2022 году",
  text: ` Главная задача игры выжить большое количество волн врагов,
    собрать как можно более сильный билд персонажа, лучшее оружие и победить босса в конце игры`,
};

export const ArenaPosts = [
  {
    image: image110723,
    title: "Update: #110723: Обновление ",
    text: `Большое обновление!
      
      * В игру добавленно 4 босса
      | * Комната с боссом после прохождения 20 волн

      * Добавленна 2 дополнительные карты
      * Добавленна большая карта
      | * Колличество волн необходимых для появления босса - 30

      * Пистолет в начале игры выбирается случайным образом
      * Добавленно два новых пистолета,
      
      Мелочи:
       переработа анимация перезарядки Termit Compact S 
       исправленны баги, добавленны новые`,
  },
  {
    image: image110723,
    title: "Update: #110723: Обновление Финала",
    text: `Поздравляю! Теперь игру можно пройти!
      
      * В игру добавленно 4 босса
      | * Комната с боссом после прохождения 20 волн

      * Добавленна 2 дополнительные карты
      * Добавленна большая карта
      | * Колличество волн необходимых для появления босса - 30

      * Пистолет в начале игры выбирается случайным образом
      * Добавленно два новых пистолета,
      
      Мелочи:
       переработа анимация перезарядки Termit Compact S 
       исправленны баги, добавленны новые`,
  },
  {
    image: image,
    title: "Update: #210623: Обновление Арена",
    text: ` Первый выход арены и первая полноценная итерация игры "ForwardDungeon - Arena"
  
      * 25+ единиц оружия
      | * 2 типа стрельбы с мгновенным уроном и с летящим выстрелом
      | * Может быть модифицированно предметами
      | * Особое оружие первый представитель которого: кнопка, разово убивающая всех противников 
      *  10+ предметов
      * Случайный случайный спавн противников 
      | * 10+ видов противников
      | * Мини босс который с 50% шансом дропает бластер который нельзя получить другим способом`,
  },
];
