import image from "../images/210623.png";
import closet from '../images/closet.png';

export const FDPosts = [
    {
      image: closet,
      title: "Подземелье на текущий момент закрыто :(",
      text: ""
    },
  ];

export const ArenaPosts = [
  {
    image: image,
    title: "Update: #110723: Обновление Финала",
    text: "Поздравляю! Теперь игру можно пройти!",
  },
  {
    image: image,
    title: "Update: #210623: Обновление Арена",
    text: `25+ единиц оружия 
    2 типа стрельбы с мгновенным уроном и с летящим выстрелом
    Может быть модифицированно предметами 
    Особое оружие первый представитель которого: кнопка, разово убивающая всех противников 
    10+ предметов
    Случайный случайный спавн противников 
    10 видов противников
    мини босс который с 50% шансом дропает бластер который нельзя получить другим способом`,
  },
];

export const BunkerPosts = [
    {
      image: closet,
      title: "Бункер на текущий момент закрыт :(",
      text: ""
    },
  ];
  
